sdcard/htp/howto/sock-epoll/ab-test-result

This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)...INFO: POST header == 
---
GET / HTTP/1.0
Host: localhost:8088
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.1 200
Content-Length: 12

hello world!
LOG: Response code = 200
..done


Server Software:        
Server Hostname:        localhost
Server Port:            8088

Document Path:          /
Document Length:        12 bytes

Concurrency Level:      1
Time taken for tests:   0.000 seconds
Complete requests:      1
Failed requests:        0
Write errors:           0
Total transferred:      48 bytes
HTML transferred:       12 bytes
Requests per second:    5405.41 [#/sec] (mean)
Time per request:       0.185 [ms] (mean)
Time per request:       0.185 [ms] (mean, across all concurrent requests)
Transfer rate:          253.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    0   0.0      0       0
Waiting:        0    0   0.0      0       0
Total:          0    0   0.0      0       0
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8088

Document Path:          /
Document Length:        12 bytes

Concurrency Level:      1
Time taken for tests:   1.223 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      480000 bytes
HTML transferred:       120000 bytes
Requests per second:    8173.59 [#/sec] (mean)
Time per request:       0.122 [ms] (mean)
Time per request:       0.122 [ms] (mean, across all concurrent requests)
Transfer rate:          383.14 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       5
Processing:     0    0   0.1      0       9
Waiting:        0    0   0.0      0       2
Total:          0    0   0.1      0       9

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      0
 100%      9 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8088

Document Path:          /
Document Length:        12 bytes

Concurrency Level:      10
Time taken for tests:   1.143 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      480000 bytes
HTML transferred:       120000 bytes
Requests per second:    8745.24 [#/sec] (mean)
Time per request:       1.143 [ms] (mean)
Time per request:       0.114 [ms] (mean, across all concurrent requests)
Transfer rate:          409.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.3      0       6
Processing:     0    1   0.3      1       6
Waiting:        0    0   0.2      0       3
Total:          1    1   0.4      1       6
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      2
  98%      3
  99%      3
 100%      6 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8088

Document Path:          /
Document Length:        12 bytes

Concurrency Level:      100
Time taken for tests:   1.215 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      480000 bytes
HTML transferred:       120000 bytes
Requests per second:    8228.24 [#/sec] (mean)
Time per request:       12.153 [ms] (mean)
Time per request:       0.122 [ms] (mean, across all concurrent requests)
Transfer rate:          385.70 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4    6   1.2      6      15
Processing:     2    6   1.7      6      17
Waiting:        0    3   1.7      3      15
Total:          7   12   2.3     11      24

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     12
  80%     13
  90%     13
  95%     18
  98%     22
  99%     22
 100%     24 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8088

Document Path:          /
Document Length:        12 bytes

Concurrency Level:      1000
Time taken for tests:   1.242 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      480000 bytes
HTML transferred:       120000 bytes
Requests per second:    8049.26 [#/sec] (mean)
Time per request:       124.235 [ms] (mean)
Time per request:       0.124 [ms] (mean, across all concurrent requests)
Transfer rate:          377.31 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       47   57   5.8     56      75
Processing:    28   64   8.9     66      82
Waiting:        6   30  13.9     30      72
Total:         78  121  11.1    122     143

Percentage of the requests served within a certain time (ms)
  50%    122
  66%    123
  75%    123
  80%    123
  90%    141
  95%    142
  98%    142
  99%    143
 100%    143 (longest request)